[
  {
    "id": 1,
    "nombre": "Luna",
    "especie": "Perro",
    "raza": "Golden Retriever",
    "sexo": "Hembra",
    "edad": "2 años",
    "tamaño": "Mediano",
    "ubicacion": "San José",
    "estadoSalud": "Saludable",
    "vacunas": ["Rabia", "Parvovirus", "Moquillo"],
    "condicionesEspeciales": ["Ninguna"],
    "comportamiento": ["Cariñosa", "Activa", "Juguetona"],
    "compatibilidad": {
      "ninos": true,
      "otrosPerros": true,
      "gatos": false
    },
    "descripcion": "Luna es una perrita muy cariñosa y juguetona, ideal para familias con niños pequeños. Le encanta correr en espacios abiertos y jugar a atrapar la pelota. Es sociable con otros perros y disfruta mucho de la compañía humana. No se lleva muy bien con gatos, ya que suele ponerse nerviosa con ellos. Luna no presenta condiciones especiales de salud y se encuentra vacunada contra rabia, parvovirus y moquillo. Tiene miedo a los truenos y a los fuegos artificiales, por lo que necesita un espacio tranquilo en esos momentos. Es una excelente opción para una familia activa que le dedique tiempo de calidad.",
    "fotoPortada": "https://www.purina.com.ar/sites/default/files/2023-06/como-calcular-la-edad-de-los-perros-1.jpg",
    "fotosExtras": [
      "https://placedog.net/400/200?id=1",
      "https://placedog.net/400/200?id=2"
    ],
    "videos": [
      "https://www.youtube.com/embed/48fQIBw3nMg"
    ]
  },
  {
    "id": 2,
    "nombre": "Milo",
    "especie": "Gato",
    "raza": "Bombay",
    "sexo": "Macho",
    "edad": "1 año",
    "tamaño": "Pequeño",
    "ubicacion": "Cartago",
    "estadoSalud": "Saludable",
    "vacunas": ["Triple felina"],
    "condicionesEspeciales": ["Ninguna"],
    "comportamiento": ["Tranquilo", "Limpio"],
    "compatibilidad": {
      "ninos": false,
      "otrosPerros": false,
      "gatos": true
    },
    "descripcion": "Milo es un gato muy tranquilo y limpio, ideal para hogares con pocas mascotas. Prefiere ambientes silenciosos y personas pacientes que respeten su espacio. Es muy cariñoso con sus dueños una vez entra en confianza, aunque al principio puede mostrarse un poco tímido. No le gustan los ruidos fuertes y suele esconderse si hay muchas personas. Se lleva bien con otros gatos, pero no con perros ni con niños pequeños ya que se estresa con facilidad. Está vacunado con la triple felina y no tiene condiciones de salud especiales. Milo disfruta mucho de dormir cerca de la ventana y observar el exterior. Tiene miedo a los aspiradores y a los ruidos metálicos fuertes.",
    "fotoPortada": "https://www.sanicat.com/wp-content/uploads/2022/09/00_blackcats.png",
    "fotosExtras": [
      "https://placekitten.com/400/200",
      "https://placekitten.com/401/200"
    ],
    "videos": [
      "https://www.youtube.com/embed/oa4if1nfN6I"
    ]
  },
  {
    "id": 3,
    "nombre": "Rex",
    "especie": "Perro",
    "raza": "Pastor Alemán",
    "sexo": "Macho",
    "edad": "3 años",
    "tamaño": "Grande",
    "ubicacion": "Heredia",
    "estadoSalud": "En tratamiento",
    "vacunas": ["Rabia"],
    "condicionesEspeciales": ["Leve displasia de cadera"],
    "comportamiento": ["Activo", "Protector", "Leal"],
    "compatibilidad": {
      "ninos": true,
      "otrosPerros": true,
      "gatos": false
    },
    "descripcion": "Rex es un perro grande, fuerte y muy leal. Es muy activo, necesita espacio para correr y hacer ejercicio a diario. Ideal para familias con casa y jardín amplio. Se encuentra actualmente en tratamiento por una leve displasia de cadera, pero eso no le impide llevar una vida activa. Rex es muy protector con su familia y le gusta estar siempre acompañado. Se lleva bien con niños y otros perros, pero no es compatible con gatos. Está vacunado contra la rabia. Su carácter es noble, aunque a veces puede ponerse ansioso si pasa mucho tiempo solo. Tiene miedo a quedarse encerrado en espacios muy pequeños, ya que se siente atrapado. Rex es perfecto para alguien con experiencia en perros grandes y que pueda darle tiempo y energía.",
    "fotoPortada": "https://placedog.net/400/182?id=35",
    "fotosExtras": [
      "https://placedog.net/400/200?id=36",
      "https://placedog.net/400/200?id=37"
    ],
    "videos": [
      "https://www.youtube.com/embed/l6_GLPKpNvA"
    ]
  }
]
